app/controllers/api/v1/auth_controller.rb

  def create
    binding.pry
    user = User.find_by(username: auth_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "gene"], ["LIMIT", 1]]

  def show
    token = request.headers['token']
    decoded = JWT.decode(token, ENV['secret'], true, { algorithm: ENV['algo'] })
    user = User.find_by(username: decoded[0]['username'])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "gene"], ["LIMIT", 1]]