app/controllers/api/v1/portfolios_controller.rb

  def create
    portfolio = Portfolio.create(name: portfolio_params[:name], description: portfolio_params[:description], user_id: portfolio_params[:user_id])
    if portfolio.valid?
      portfolio.balance -= 2000
      portfolio.initialCoins = portfolio_params[:initialCoins]
      portfolio.save
---
INSERT INTO "portfolios" ("name", "description", "balance", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test portfolio"], ["description", "test description"], ["balance", "8000.0"], ["user_id", 1], ["created_at", "2017-12-21 19:53:55.330931"], ["updated_at", "2017-12-21 19:53:55.330931"]]
INSERT INTO "coins" ("name", "symbol", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ethereum"], ["symbol", "ETH"], ["created_at", "2017-12-20 20:21:31.165089"], ["updated_at", "2017-12-20 20:21:31.165089"]]
UPDATE "portfolios" SET "balance" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["balance", "8000.0"], ["updated_at", "2017-12-21 19:58:14.223431"], ["id", 2]]

  def show
    token = request.headers['token']
    decoded = JWT.decode(token, ENV['secret'], true, { algorithm: ENV['algo'] })
    user = User.find_by(id: decoded[0]['id'])

    if user
      render json: user.portfolios.first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 ORDER BY "portfolios"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]