app/controllers/api/v1/portfolio_coins_controller.rb

  def create
    binding.pry
    portfolio = Portfolio.find_by(id: trans_params[:portfolioId])

    coin = Coin.find_or_create_by(name: trans_params[:coinName], symbol: trans_params[:coinSymbol])

    quantity = trans_params[:transactionAmount] / trans_params[:transactionPrice]

    transaction = PortfolioCoin.new(trans_price: trans_params[:transactionPrice], trans_amt: trans_params[:transactionAmount], trans_type: trans_params[:transactionType], quantity: quantity, paper_currency:'USD', portfolio_id: portfolio.id, coin_id: coin.id)

    if transaction.valid?
      transaction.save
      portfolio.balance -= trans_params[:transactionAmount]
      portfolio.save
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "coins" ("symbol", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["symbol", "ETH"], ["created_at", "2018-01-02 22:26:48.076011"], ["updated_at", "2018-01-02 22:26:48.076011"]]
SELECT  "coins".* FROM "coins" WHERE "coins"."name" IS NULL AND "coins"."symbol" = $1 LIMIT $2  [["symbol", "ETH"], ["LIMIT", 1]]
INSERT INTO "portfolio_coins" ("trans_price", "trans_amt", "trans_type", "quantity", "paper_currency", "portfolio_id", "coin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "portfolios" SET "balance" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["balance", "6500.0"], ["updated_at", "2018-01-02 22:26:48.213479"], ["id", 1]]