app/controllers/api/v1/users_controller.rb

  def create
    user = User.new({username: user_params['username'], password: user_params['password'], password_confirmation: user_params['passwordConfirmation']})

    if user.valid?
      user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"